# IsValidShape Method (IList(GeometryObject), DirectShapeTargetViewType)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShape..::..IsValidShape Method (IList<(Of <(<'GeometryObject>)>)>, DirectShapeTargetViewType)
DirectShape Class See Also
---
Validates view-specific shape to be stored in a DirectShape. Expects a non-default view type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsValidShape(
	IList<GeometryObject> shape,
	DirectShapeTargetViewType viewType
)
```

Visual Basic
---
```text
Public Function IsValidShape ( _
	shape As IList(Of GeometryObject), _
	viewType As DirectShapeTargetViewType _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidShape(
	IList<GeometryObject^>^ shape,
	DirectShapeTargetViewType viewType
)
```

# ### Parameters
shape
    Type: System.Collections.Generic..::..IList<(Of <(<'GeometryObject>)>)> Shape of this object expressed as a collection of GeometryObjects. For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve. For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType
    Type: Autodesk.Revit.DB..::..DirectShapeTargetViewType The view type this shape is intended for.
# ### Return Value
True if the supplied shape passes the validation criteria.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DirectShape Class
IsValidShape Overload
Autodesk.Revit.DB Namespace